# Pandas:-

### Uses:-
    To read and manuplate Data

### Types of Data stucture:-
    1) Series:- 1d Data stucture
    2) DataFrame:- 2d Data Stucture(mostly used data stucture)
    3) Panel:- 3d Data Stucture

# Series Data stucture

It is 1 Dimensional Data stucture which contain Hetroginous data.
It have only one column.

### How to make series Data:
1st way-By list:

In [4]:
import pandas

In [5]:
list1=[2,3,4]
series1=pandas.Series(list1)
series1
# to see the result Press cntl+enter

0    2
1    3
2    4
dtype: int64

In [16]:
# how to give own index Name(Same like rowIndex in Excel)
list2=[10,20,30]
indexNumber=['a','b','c']
series2=pandas.Series(list2,index=indexNumber)
series2
# note:-Number of elements in indexNumber should be equal to Number of elements in list
# to see the result Press cntl+enter

a    10
b    20
c    30
dtype: int64

In [13]:
# how to give own dtype
list3=[100,200,300]
indexNumber3=['aa','bb','cc']
series3=pandas.Series(list3,index=indexNumber3,dtype='float')
series3
## to see the result Press cntl+enter

a    10
b    20
c    30
dtype: object

In [25]:
# How to give name of series
list4=[1000,2000,3000]
indexNumber4=['aaa','bbb','ccc']
series4=pandas.Series(list4,index=indexNumber4,dtype='float',name='abh')
series4
## to see the result Press cntl+enter

aaa    1000.0
bbb    2000.0
ccc    3000.0
Name: abh, dtype: float64

In [26]:
#2nd way to make series:-by dictionary
dict1={'a':1,'b':2}
series5=pandas.Series(dict1)
series5
#note:-to make series by dictonary key value become IndexNumber
## to see the result Press cntl+enter

a    1
b    2
dtype: int64

In [30]:
# If you want to give index number to your series, then key value of dictonary should macth with your index number. otherwise see below result
dict2={'a':1,'b':2}
series6=pandas.Series(dict2,index=['a','b'])
series6
## to see the result Press cntl+enter

a    1
b    2
dtype: int64

In [31]:
# If you want to give index number to your series, then key value of dictonary should macth with your index number.
dict2={'a':1,'b':2}
series7=pandas.Series(dict2,index=['x','y'])
series7
## to see the result Press cntl+enter

x   NaN
y   NaN
dtype: float64

### How to access value from series

In [54]:
# By slice oprator 
l8=[2,3,4]
s8=pandas.Series(l8)
s8[1]
#note:-In slice operator you mention the index number of corresponding element
## to see the result Press cntl+enter

'a'

### Methods of Series datatype

In [55]:
#you can performe mathmatical oprations on series
l9=[2,3,4]
s9=pandas.Series(l9)
l10=[3,4,5]
s10=pandas.Series(l10)
print(s9.max())
s9+s10

4

0    5
1    7
2    9
dtype: int64

# DataFrame Data Structure

It is 2 Dimensional Data stucture which contain Hetroginous data.
It have multiple columns(called labels) and multiple Row(call Index), just like in excel range(a1:d10)

## How to Create DataFrame
***

In [56]:
#1st way:- by list of list
l1=[[1,2,3],[10,20,30],[100,200,300]]
df1=pandas.DataFrame(l1)
df1

     0    1    2
0    1    2    3
1   10   20   30
2  100  200  300

In [68]:
# how to give index(called Row Number) and columns to DataFrame
l2=[[1,2,3],[10,20,30]]
df2=pandas.DataFrame(l2,index=['r1','r2'],columns=['c1','c2','c3'])
print(df2)
# note:-Here element in index should be equal to number of list inside parent list & number of elements in columns 
#should be equal to maximum number of elements inside any list of list.

l3=[[11,22,33],[111,222]]
df3=pandas.DataFrame(l3,index=['r1','r2'],columns=['c1','c2','c3'])
print(df3)

    c1  c2  c3
r1   1   2   3
r2  10  20  30
     c1   c2    c3
r1   11   22  33.0
r2  111  222   NaN

# Read CSV File

In [80]:
df=pandas.read_csv(r"C:\Users\DELL\Desktop\Results.csv")
df

    Security Code Security Name  Company name Result Date
0        541988.0         AAVAS         391.0   29-Apr-21
1        500425.0     AMBUJACEM         207.0   29-Apr-21
2        532475.0       APTECHT         454.0   29-Apr-21
3        500215.0          ATFL         624.0   29-Apr-21
4        540611.0        AUBANK         232.0   29-Apr-21
5        532977.0    BAJAJ-AUTO         128.0   29-Apr-21
6        500490.0    BAJAJHLDNG         344.0   29-Apr-21
7        534758.0       CIGNITI         585.0   29-Apr-21
8        506395.0    COROMANDEL         123.0   29-Apr-21
9        542216.0     DALBHARAT         290.0   29-Apr-21
10       542602.0       EMBASSY         502.0   29-Apr-21
11            NaN           NaN           NaN         NaN
12            NaN           NaN           NaN         NaN
13            NaN           NaN           NaN         NaN
14            NaN           NaN           NaN         NaN
15            NaN           NaN           NaN         NaN
16            NaN           NaN           NaN         NaN
17            NaN           NaN           NaN         NaN
18            NaN           NaN           NaN         NaN
19            NaN           NaN           NaN         NaN
20            NaN           NaN           NaN         NaN
21            NaN           NaN           NaN         NaN
22            NaN           NaN           NaN         NaN
23            NaN           NaN           NaN         NaN
24            NaN           NaN           NaN         NaN
25            NaN           NaN           NaN         NaN
26            NaN           NaN           NaN         NaN
27            NaN           NaN           NaN         NaN
28            NaN           NaN           NaN         NaN
29            NaN           NaN           NaN         NaN
30            NaN           NaN           NaN         NaN
31            NaN           NaN           NaN         NaN
32            NaN           NaN           NaN         NaN
33            NaN           NaN           NaN         NaN
34            NaN           NaN           NaN         NaN
35            NaN           NaN           NaN         NaN

In [71]:
#If you want to know size and shape of Data Frame
df.shape

(36, 4)

In [72]:
# if you want know full information of Dataframe like how many rows,coloumns,there dataype,null values
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36 entries, 0 to 35
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Security Code  11 non-null     float64
 1   Security Name  11 non-null     object
 2   Company name   11 non-null     float64
 3   Result Date    11 non-null     object
dtypes: float64(2), object(2)
memory usage: 1.2+ KB

In [79]:
# If you data fram is to big, then jupyter display only some data only. but if you want to show all data of your frame then
pandas.set_option('display.max_columns',4)

In [84]:
#If you want to make new data dataframe which contains only headings of your dataframe
scema_df=pandas.read_csv(r"C:\Users\DELL\Desktop\Results_schema.csv")
scema_df

FileNotFoundError: [Errno 2] No such file or directory: 'C:\\Users\\DELL\\Desktop\\Results_schema.csv'

In [86]:
# if you want to show particular numbers of rows from top of your dataframe
df.head(10)
# note:-if you not pass parameter in it, then defaulted it take 5

   Security Code Security Name  Company name Result Date
0       541988.0         AAVAS         391.0   29-Apr-21
1       500425.0     AMBUJACEM         207.0   29-Apr-21
2       532475.0       APTECHT         454.0   29-Apr-21
3       500215.0          ATFL         624.0   29-Apr-21
4       540611.0        AUBANK         232.0   29-Apr-21
5       532977.0    BAJAJ-AUTO         128.0   29-Apr-21
6       500490.0    BAJAJHLDNG         344.0   29-Apr-21
7       534758.0       CIGNITI         585.0   29-Apr-21
8       506395.0    COROMANDEL         123.0   29-Apr-21
9       542216.0     DALBHARAT         290.0   29-Apr-21

In [ ]:
# if you want to show particular numbers of rows of your rows from bottom of your dataframe
df.tail(7)
# note:-if you not pass parameter in it, then defaulted it take 5

## Access data value from DataFrame

In [205]:
d1={'a':1,'b':2}
d2={'a':11,'b':22}
d3={'a':[1,2,3],'b':[11,22,33],'c':[111,222,333]}
df2=pandas.DataFrame(d1,d2)
df1=pandas.DataFrame(d3)
df1

   a   b    c
0  1  11  111
1  2  22  222
2  3  33  333

In [208]:
# 1st way to access single column:-by (dictonary key/headings) value in slice oprator (This is recommended)
df1['a']

# type(df1['a'])
# this return series data not a dataFrame

0    1
1    2
2    3
Name: a, dtype: int64

In [92]:
#2nd way to access single column:-by dictonary key value as attribute
df1.a

0    1
1    2
Name: a, dtype: int64

In [97]:
# if you want to access multiple columns: by dictonary key/headings value in slice oprator in list
df1[['a','c']]
# This return a dataframe datatype because it has more than 1 column

   a    c
0  1  111
1  2  222
2  3  333

In [99]:
# if you want to know only headings or index of your dataframe
df1.columns

pandas.core.indexes.base.Index

In [100]:
# if you want to access single rows: iloc ke parameter me row index pass kare
df1.iloc[1]

a      2
b     22
c    222
Name: 1, dtype: int64

In [102]:
# if you want to access multiple rows: iloc ke function m list ke ander multi row index pass kare
df1.iloc[[0,2]]

   a   b    c
0  1  11  111
2  3  33  333

In [103]:
# if you want to access multi rows with multi columns: iloc ke function m list ke ander multi row index or list ke ander multi column index pass kare
df1.iloc[[0,1],[1,2]]

# here 1st list parameter of row index and 2nd list for column index

    b    c
0  11  111
1  22  222

In [113]:
# Note:-if you want to use slice operator then you should pass slice operation without using square bracket lock or iloc methods
df1.iloc[1:,0:2]

   a   b
1  2  22
2  3  33

In [105]:
# iloc vs loc
# iloc:- isme hame parameter m row index or column index pass karane hote hai(just like offset(1,1))
# loc:- isme hame parameter m row ka name or column ka name pass karana hota hai( just like range(d11)).
#     :- true value ko be return karta hai jiska use filter m bhot hota hai

   a  b
a  1  2
b  1  2

In [106]:
df2.iloc[1,1]

2

In [110]:
df2.loc['a','b']

2

In [120]:
df1.loc[1,'a':'c']

a      2
b     22
c    222
Name: 1, dtype: int64

In [126]:
# if you want set any particular coloumn as index(row name) of your dataframe:
df1.set_index('c')
df1

     a   b
c
111  1  11
222  2  22
333  3  33

In [142]:
df1.loc[111]

# note:-above code never gone be in action until you don't provided 2nd argument in set_index method that is inplace=ture

a     1
b    11
Name: 111, dtype: int64

In [146]:
df1.set_index('c',inplace=True)
df1
# Note:- by doing this so, column c is not be there b'coz it become a index of our dataframe
# if you now check the shapce of your data frame( by .shape property) there will be a 1 less column as original one
# Here you can check new index of you data frame (by .index property)
# inplace=true tell that you are ensure to whatever changes you do in current data will reflect the original data 
# you can also set index any column at time of reading dataFram (by index_col="name of column" parameter pass karake)

KeyError: "None of ['c'] are in the columns"

In [145]:
df1.loc[111,'b']

11

In [152]:
df1.shape

(3, 4)

In [193]:
df1.index

RangeIndex(start=0, stop=3, step=1)

In [151]:
# it set defult index as original one
df1.reset_index(inplace=True)
df1

   index    c  a   b
0      0  111  1  11
1      1  222  2  22
2      2  333  3  33

# Filter

In [159]:
df=pandas.read_csv(r"C:\Users\DELL\Desktop\Results.csv",nrows=11)
df

    Security Code Security Name  Company name Result Date
0          541988         AAVAS           391   29-Apr-21
1          500425     AMBUJACEM           207   29-Apr-21
2          532475       APTECHT           454   29-Apr-21
3          500215          ATFL           624   29-Apr-21
4          540611        AUBANK           232   29-Apr-21
5          532977    BAJAJ-AUTO           128   29-Apr-21
6          500490    BAJAJHLDNG           344   29-Apr-21
7          534758       CIGNITI           585   29-Apr-21
8          506395    COROMANDEL           123   29-Apr-21
9          542216     DALBHARAT           290   29-Apr-21
10         542602       EMBASSY           502   29-Apr-21

In [210]:
df['Security Name']

Security Code
541988         AAVAS
500425     AMBUJACEM
532475       APTECHT
500215          ATFL
540611        AUBANK
532977    BAJAJ-AUTO
500490    BAJAJHLDNG
534758       CIGNITI
506395    COROMANDEL
542216     DALBHARAT
542602       EMBASSY
Name: Security Name, dtype: object

In [199]:
df.iloc[:,2]

Security Code
541988    29-Apr-21
500425    29-Apr-21
532475    29-Apr-21
500215    29-Apr-21
540611    29-Apr-21
532977    29-Apr-21
500490    29-Apr-21
534758    29-Apr-21
506395    29-Apr-21
542216    29-Apr-21
542602    29-Apr-21
Name: Result Date, dtype: object

In [256]:
#filter data according to one condition

filt=(df['Security Name']== 'AAVAS')
df.loc[filt]

              Security Name  Company name Result Date
Security Code
541988                AAVAS           391   29-Apr-21

In [258]:
# filter data according to multiple condition with (&-->represent 'and' condition) (|-->represend 'or' condition)

filt=(df['Security Name']== 'AAVAS') | (df['Security Name']== 'APTECHT')
df.loc[filt]

              Security Name  Company name Result Date
Security Code
541988                AAVAS           391   29-Apr-21
532475              APTECHT           454   29-Apr-21

In [260]:
# filter data which is oppsitive to multiple condition (&-->represent 'and' condition) (|-->represend 'or' condition): Provide (-)minus to final condition
# Ex-1
filt=(df['Security Name']== 'AAVAS') | (df['Security Name']== 'APTECHT')
df.loc[-(filt)]

              Security Name  Company name Result Date
Security Code
500425            AMBUJACEM           207   29-Apr-21
500215                 ATFL           624   29-Apr-21
540611               AUBANK           232   29-Apr-21
532977           BAJAJ-AUTO           128   29-Apr-21
500490           BAJAJHLDNG           344   29-Apr-21
534758              CIGNITI           585   29-Apr-21
506395           COROMANDEL           123   29-Apr-21
542216            DALBHARAT           290   29-Apr-21
542602              EMBASSY           502   29-Apr-21

In [262]:
# filter data which is oppsitive to multiple condition (&-->represent 'and' condition) (|-->represend 'or' condition): Provide (-)minus to final condition
# Ex-2
filt=(df['Security Name']== 'AAVAS') | (df['Security Name']== 'APTECHT')
df.loc[-(filt),'Company name']

Security Code
500425    207
500215    624
540611    232
532977    128
500490    344
534758    585
506395    123
542216    290
542602    502
Name: Company name, dtype: int64

In [ ]:
r[r['URL']!='NA']

In [ ]:
#greater salary >7000    by isin method  (eg--> f=df['a'].isin['kakk','guddu'])
# find special country data bt str.contens(eg-->  f=df['a'].str.contens['vijay','kakkry']

# Update & modifying row & columns & data value

In [275]:
d3={'a':[1,2,3],'b':[11,22,33],'c':[111,222,333]}
df=pandas.DataFrame(d3)
df

   a   b    c
0  1  11  111
1  2  22  222
2  3  33  333

In [266]:
#to check the coloumn index
col_x=df.columns
#to_check the row index
row_x=df.index
print(col_x,row_x)

Index(['a', 'b', 'c'], dtype='object') RangeIndex(start=0, stop=3, step=1)

In [267]:
#Rename columns index
df.columns=['aa','bb','cc']
df

   aa  bb   cc
0   1  11  111
1   2  22  222
2   3  33  333

In [268]:
#Rename row_index
df.index=[11,22,33]
df

    aa  bb   cc
11   1  11  111
22   2  22  222
33   3  33  333

In [271]:
#Rename all columns index name as upper case: by using list comprehension
df.columns=[x.upper() for x in df.columns]
df.columns

Index(['AA', 'BB', 'CC'], dtype='object')

In [274]:
#Rename columns index name 
df.rename(columns={'AA':'a','BB':'b','CC':'c'},inplace=True)
df

    a   b    c
11  1  11  111
22  2  22  222
33  3  33  333

In [303]:
#Update and modify any data
#first we access that data which we want to update, end assign value to it by pressing equal to
#loc and iloc method is best for accessing the data

   a   b    c
0  1  11  111
1  2  22  222
2  3  33  333

In [305]:
df.loc[1,'a']=10
df

2

In [302]:
df.loc[[1,2],'a']=20
df

TypeError: 'slice(None, None, None)' is an invalid key

In [306]:
df.loc[[1,2],'a']=[30,40]
df

    a   b    c
0   1  11  111
1  30  22  222
2  40  33  333

In [320]:
#If you want to change data according value, it can be possible by filter
filt=(df['a']==2)
df.loc[filt,'c']=500
df

     a   b    c
0  100   2  100
1    2   2  500
2   40  33  333

In [316]:
df.loc[1,:]=2
df

     a   b    c
0  100   2  100
1    2   2    2
2   40  33  333